---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.Dispose
source: html/04868aec-2b5b-1d9e-39ae-d534deb885f7.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.Dispose Method

Releases all resources used by the FieldBuilder

## Syntax (C#)
```csharp
public void Dispose()
```